### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.container_apps.module.payment_updater_ca_itn_01.azurerm_container_app.this will be destroyed
  # (because azurerm_container_app.this is not in configuration)
  - resource "azurerm_container_app" "this" {
      - container_app_environment_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.App/managedEnvironments/io-p-itn-com-cae-01" -> null
      - custom_domain_verification_id = (sensitive value) -> null
      - id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.App/containerApps/io-p-itn-com-paymentup-ca-01" -> null
      - latest_revision_fqdn          = "io-p-itn-com-paymentup-ca-01--v00kqz0.bluesand-bdc6dc22.italynorth.azurecontainerapps.io" -> null
      - latest_revision_name          = "io-p-itn-com-paymentup-ca-01--v00kqz0" -> null
      - location                      = "italynorth" -> null
      - max_inactive_revisions        = 0 -> null
      - name                          = "io-p-itn-com-paymentup-ca-01" -> null
      - outbound_ip_addresses         = [] -> null
      - resource_group_name           = "io-p-itn-com-rg-01" -> null
      - revision_mode                 = "Single" -> null
      - tags                          = {
          - "BusinessUnit"   = "App IO"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Comunicazione"
          - "ModuleName"     = "azure_container_app"
          - "ModuleSource"   = "DX"
          - "ModuleVersion"  = "3.0.1"
          - "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        } -> null
      - workload_profile_name         = "Consumption" -> null

      - identity {
          - identity_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/io-p-itn-com-cae-id-01",
            ] -> null
          - principal_id = "4404f5eb-d605-43d0-a352-5f688a6b84d8" -> null
          - tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
          - type         = "SystemAssigned, UserAssigned" -> null
        }

      - ingress {
          - allow_insecure_connections = false -> null
          - custom_domain              = [] -> null
          - exposed_port               = 0 -> null
          - external_enabled           = true -> null
          - fqdn                       = "io-p-itn-com-paymentup-ca-01.bluesand-bdc6dc22.italynorth.azurecontainerapps.io" -> null
          - target_port                = 9090 -> null
          - transport                  = "auto" -> null
            # (1 unchanged attribute hidden)

          - traffic_weight {
              - latest_revision = true -> null
              - percentage      = 100 -> null
                # (2 unchanged attributes hidden)
            }
        }

      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      - template {
          - max_replicas                     = 1 -> null
          - min_replicas                     = 1 -> null
          - termination_grace_period_seconds = 30 -> null
            # (1 unchanged attribute hidden)

          - container {
              - cpu               = 0.5 -> null
              - ephemeral_storage = "2Gi" -> null
              - image             = "ghcr.io/pagopa/io-com-payment-updater:sha-3aa09fa" -> null
              - memory            = "1Gi" -> null
              - name              = "io-com-payment-updater" -> null

              - env {
                  - name        = "APPLICATIONINSIGHTS_ROLE_NAME" -> null
                  - value       = "io-p-itn-com-payment-updater-01" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "BOOTSTRAP_SERVER_MESSAGE" -> null
                  - value       = "io-p-messages-weu-prod01-evh-ns.servicebus.windows.net:9093" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "BOOTSTRAP_SERVER_PAYMENT" -> null
                  - value       = "pagopa-p-weu-core-evh-ns03.servicebus.windows.net:9093" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "BOOTSTRAP_SERVER_PAYMENTUPDATES" -> null
                  - value       = "io-p-payments-weu-prod01-evh-ns.servicebus.windows.net:9093" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "CHECKPOINT_SIZE" -> null
                  - value       = "10" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "ENABLE_REST_KEY" -> null
                  - value       = "true" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "IS_ACTIVE_MESSAGE_CONSUMER" -> null
                  - value       = "true" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "IS_ACTIVE_PAYMENT_CONSUMER" -> null
                  - value       = "true" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "KAFKA_MESSAGE" -> null
                  - value       = "messages" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "KAFKA_PAYMENTS" -> null
                  - value       = "nodo-dei-pagamenti-biz-evt" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "KAFKA_PAYMENT_UPDATES" -> null
                  - value       = "payment-updates" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "MAIN_LOGGING_LEVEL" -> null
                  - value       = "ERROR" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "MONGO_COLLECTION_NAME" -> null
                  - value       = "payment-sharded" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "MONGO_DATABASE" -> null
                  - value       = "db" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "MONGO_RETRY_COLLECTION_NAME" -> null
                  - value       = "payment-retry" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "PROXY_ENDPOINT" -> null
                  - value       = "https://not-used-anymore" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "QUARTZ_SCHEDULER_TIMER_NOTIFY" -> null
                  - value       = "0 /3 * ? * *" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "RESTCALL_INTERVAL_FUNCTION" -> null
                  - value       = "10000" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "RESTCALL_MAX_ATTEMPTS" -> null
                  - value       = "3" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "RETRY_INTERVAL_FUNCTION" -> null
                  - value       = "10000" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "RETRY_MAX_ATTEMPTS" -> null
                  - value       = "10" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "SASL_MECHANISM_PAYMENT" -> null
                  - value       = "PLAIN" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "SCHEDULER_RETRY_ACTIVE" -> null
                  - value       = "true" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "SCHEDULER_RETRY_SIZE" -> null
                  - value       = "100" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "SECURITY_PROTOCOL_PAYMENT" -> null
                  - value       = "SASL_SSL" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "APPLICATIONINSIGHTS_CONNECTION_STRING" -> null
                  - secret_name = "applicationinsights-connection-string" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "MONGO_DATABASE_URI" -> null
                  - secret_name = "mongo-database-uri" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "KAFKA_URL_MESSAGE" -> null
                  - secret_name = "kafka-url-message" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "KAFKA_URL_PAYMENTUPDATES" -> null
                  - secret_name = "kafka-url-paymentupdates" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "KAFKA_URL_PAYMENT" -> null
                  - secret_name = "kafka-url-payment" -> null
                    # (1 unchanged attribute hidden)
                }
              - env {
                  - name        = "PROXY_ENDPOINT_SUBSCRIPTION_KEY" -> null
                  - secret_name = "proxy-endpoint-subscription-key" -> null
                    # (1 unchanged attribute hidden)
                }

              - liveness_probe {
                  - failure_count_threshold          = 3 -> null
                  - initial_delay                    = 60 -> null
                  - interval_seconds                 = 10 -> null
                  - path                             = "/api/v1/health/live" -> null
                  - port                             = 9090 -> null
                  - termination_grace_period_seconds = 0 -> null
                  - timeout                          = 5 -> null
                  - transport                        = "HTTP" -> null
                    # (1 unchanged attribute hidden)
                }

              - readiness_probe {
                  - failure_count_threshold = 3 -> null
                  - initial_delay           = 30 -> null
                  - interval_seconds        = 10 -> null
                  - path                    = "/api/v1/health/ready" -> null
                  - port                    = 9090 -> null
                  - success_count_threshold = 1 -> null
                  - timeout                 = 5 -> null
                  - transport               = "HTTP" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-cqrs-message-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-cqrs-message-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-cqrs-message-status-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-cqrs-message-status-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-payment-updates-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-payment-updates-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-reminder-message-send-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-etl-reminder-message-send-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-evh-01.cqrs"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "cqrs"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-evh-01.paymentup"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "paymentup"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-evh-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-status-evh-01.cqrs"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-status-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "cqrs"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-cqrs-message-status-evh-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-cqrs-message-status-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-payment-updates-evh-01.cqrs"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-payment-updates-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "cqrs"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-payment-updates-evh-01.payment-updater"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-payment-updates-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "payment-updater"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-payment-updates-evh-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-payment-updates-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-reminder-message-send-01.reminder"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-etl-reminder-message-send-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "reminder"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 13 to add, 0 to change, 1 to destroy.

```
</details>
